XRay3D/Zhele/include/zhele/platform/stm32/common/impl/flash.h
/**
 * @file
 * @brief Implement flash
 * @author Alexey Zhelonkin
 * @date 2024
 * @license MIT
 */

#ifndef ZHELE_PLATFORM_STM32_COMMON_IMPL_FLASH_H
#define ZHELE_PLATFORM_STM32_COMMON_IMPL_FLASH_H

#include <cstdint>

namespace Zhele
{
    inline constexpr unsigned Flash::SqrtOfPowerOfTwo(uint32_t value)
    {
        unsigned result = 0;

        if (value & (value - 1))
            return 0xffffffff;

        while (value != (1 << result))
            ++result;

        return result;
    }

    inline constexpr uint32_t Flash::FlashSize()
    {
    #if defined (FLASH_SIZE)
        return FLASH_SIZE;
    #elif defined (FLASH_END)
        return FLASH_END - FLASH_BASE;
    #elif defined (FLASH_BANK2_END)
        return FLASH_BANK2_END - FLASH_BASE;
    #elif defined (FLASH_BANK1_END)
        return FLASH_BANK1_END - FLASH_BASE;
    #else
        #error "Cannot determine flash size"
    #endif
    }

    inline constexpr uint32_t Flash::PageAddress(unsigned page)
    {
        return FLASH_BASE + page * PageSize(page);
    }

    inline bool Flash::Unlock()
    {
        static constexpr uint32_t flashKey1 = 0x45670123UL;
        static constexpr uint32_t flashKey2 = 0xCDEF89ABUL;

        FLASH->KEYR = flashKey1;
        FLASH->KEYR = flashKey2;
        
        WaitWhileBusy();

        return (FLASH->CR & FLASH_CR_LOCK) > 0;
    }

    inline void Flash::Lock()
    {
        FLASH->CR |= FLASH_CR_LOCK;
    }

    inline bool Flash::IsLock()
    {
        return (FLASH->CR & FLASH_CR_LOCK) != 0;
    }

    inline bool Flash::WritePage(void* dst, const void* src, unsigned size)
    {
        unsigned page = AddressToPage(dst);
		uint32_t offset = reinterpret_cast<uint32_t>(dst) - PageAddress(page);

        if(page > PageCount())
            return false;
        
        if(offset + size > PageSize(page))
            return false;

		return WriteFlash(dst, src, size);
    }

    inline bool Flash::WritePage(unsigned page, const void* src, unsigned size, unsigned offset)
    {
        if(page > PageCount())
            return false;
        
        if(offset + size > PageSize(page))
            return false;

		return WriteFlash(reinterpret_cast<uint8_t*>(PageAddress(page)) + offset, src, size);
    }

    inline void Flash::WaitWhileBusy()
    {
    #if defined (FLASH_SR_BSY1)
        while(FLASH->SR & FLASH_SR_BSY1 ) continue;
    #else
        while(FLASH->SR & FLASH_SR_BSY) continue;
    #endif
    }
}

#endif //! ZHELE_PLATFORM_STM32_COMMON_IMPL_FLASH_H